mainster/matlabCodes/RT_projects/GalvoProjekt/BACKslprj/_sfprj/stm32_pid_v1_mod/_self/sfun/src/c2_stm32_pid_v1_mod.c
static const mxArray* sf_opaque_get_sim_state_c2_stm32_pid_v1_mod(SimStruct* S)
{
  return sf_internal_get_sim_state_c2_stm32_pid_v1_mod(S);
}

static void sf_opaque_set_sim_state_c2_stm32_pid_v1_mod(SimStruct* S, const
  mxArray *st)
{
  sf_internal_set_sim_state_c2_stm32_pid_v1_mod(S, st);
}

static void sf_opaque_terminate_c2_stm32_pid_v1_mod(void *chartInstanceVar)
{
  if (chartInstanceVar!=NULL) {
    SimStruct *S = ((SFc2_stm32_pid_v1_modInstanceStruct*) chartInstanceVar)->S;
    if (sim_mode_is_rtw_gen(S) || sim_mode_is_external(S)) {
      sf_clear_rtw_identifier(S);
      unload_stm32_pid_v1_mod_optimization_info();
    }

    finalize_c2_stm32_pid_v1_mod((SFc2_stm32_pid_v1_modInstanceStruct*)
      chartInstanceVar);
    utFree((void *)chartInstanceVar);
    ssSetUserData(S,NULL);
  }
}

static void sf_opaque_init_subchart_simstructs(void *chartInstanceVar)
{
  initSimStructsc2_stm32_pid_v1_mod((SFc2_stm32_pid_v1_modInstanceStruct*)
    chartInstanceVar);
}

extern unsigned int sf_machine_global_initializer_called(void);
static void mdlProcessParameters_c2_stm32_pid_v1_mod(SimStruct *S)
{
  int i;
  for (i=0;i<ssGetNumRunTimeParams(S);i++) {
    if (ssGetSFcnParamTunable(S,i)) {
      ssUpdateDlgParamAsRunTimeParam(S,i);
    }
  }

  if (sf_machine_global_initializer_called()) {
    initialize_params_c2_stm32_pid_v1_mod((SFc2_stm32_pid_v1_modInstanceStruct*)
      (((ChartInfoStruct *)ssGetUserData(S))->chartInstance));
  }
}

static void mdlSetWorkWidths_c2_stm32_pid_v1_mod(SimStruct *S)
{
  if (sim_mode_is_rtw_gen(S) || sim_mode_is_external(S)) {
    mxArray *infoStruct = load_stm32_pid_v1_mod_optimization_info();
    int_T chartIsInlinable =
      (int_T)sf_is_chart_inlinable(S,sf_get_instance_specialization(),infoStruct,
      2);
    ssSetStateflowIsInlinable(S,chartIsInlinable);
    ssSetRTWCG(S,sf_rtw_info_uint_prop(S,sf_get_instance_specialization(),
                infoStruct,2,"RTWCG"));
    ssSetEnableFcnIsTrivial(S,1);
    ssSetDisableFcnIsTrivial(S,1);
    ssSetNotMultipleInlinable(S,sf_rtw_info_uint_prop(S,
      sf_get_instance_specialization(),infoStruct,2,
      "gatewayCannotBeInlinedMultipleTimes"));
    sf_update_buildInfo(S,sf_get_instance_specialization(),infoStruct,2);
    if (chartIsInlinable) {
      ssSetInputPortOptimOpts(S, 0, SS_REUSABLE_AND_LOCAL);
      sf_mark_chart_expressionable_inputs(S,sf_get_instance_specialization(),
        infoStruct,2,1);
      sf_mark_chart_reusable_outputs(S,sf_get_instance_specialization(),
        infoStruct,2,1);
    }

    {
      unsigned int outPortIdx;
      for (outPortIdx=1; outPortIdx<=1; ++outPortIdx) {
        ssSetOutputPortOptimizeInIR(S, outPortIdx, 1U);
      }
    }

    {
      unsigned int inPortIdx;
      for (inPortIdx=0; inPortIdx < 1; ++inPortIdx) {
        ssSetInputPortOptimizeInIR(S, inPortIdx, 1U);
      }
    }

    sf_set_rtw_dwork_info(S,sf_get_instance_specialization(),infoStruct,2);
    ssSetHasSubFunctions(S,!(chartIsInlinable));
  } else {
  }

  ssSetOptions(S,ssGetOptions(S)|SS_OPTION_WORKS_WITH_CODE_REUSE);
  ssSetChecksum0(S,(1320813385U));
  ssSetChecksum1(S,(4064180319U));
  ssSetChecksum2(S,(1598291734U));
  ssSetChecksum3(S,(1596344879U));
  ssSetmdlDerivatives(S, NULL);
  ssSetExplicitFCSSCtrl(S,1);
  ssSupportsMultipleExecInstances(S,1);
}

static void mdlRTW_c2_stm32_pid_v1_mod(SimStruct *S)
{
  if (sim_mode_is_rtw_gen(S)) {
    ssWriteRTWStrParam(S, "StateflowChartType", "Embedded MATLAB");
  }
}

static void mdlStart_c2_stm32_pid_v1_mod(SimStruct *S)
{
  SFc2_stm32_pid_v1_modInstanceStruct *chartInstance;
  chartInstance = (SFc2_stm32_pid_v1_modInstanceStruct *)utMalloc(sizeof
    (SFc2_stm32_pid_v1_modInstanceStruct));
  memset(chartInstance, 0, sizeof(SFc2_stm32_pid_v1_modInstanceStruct));
  if (chartInstance==NULL) {
    sf_mex_error_message("Could not allocate memory for chart instance.");
  }

  chartInstance->chartInfo.chartInstance = chartInstance;
  chartInstance->chartInfo.isEMLChart = 1;
  chartInstance->chartInfo.chartInitialized = 0;
  chartInstance->chartInfo.sFunctionGateway =
    sf_opaque_gateway_c2_stm32_pid_v1_mod;
  chartInstance->chartInfo.initializeChart =
    sf_opaque_initialize_c2_stm32_pid_v1_mod;
  chartInstance->chartInfo.terminateChart =
    sf_opaque_terminate_c2_stm32_pid_v1_mod;
  chartInstance->chartInfo.enableChart = sf_opaque_enable_c2_stm32_pid_v1_mod;
  chartInstance->chartInfo.disableChart = sf_opaque_disable_c2_stm32_pid_v1_mod;
  chartInstance->chartInfo.getSimState =
    sf_opaque_get_sim_state_c2_stm32_pid_v1_mod;
  chartInstance->chartInfo.setSimState =
    sf_opaque_set_sim_state_c2_stm32_pid_v1_mod;
  chartInstance->chartInfo.getSimStateInfo =
    sf_get_sim_state_info_c2_stm32_pid_v1_mod;
  chartInstance->chartInfo.zeroCrossings = NULL;
  chartInstance->chartInfo.outputs = NULL;
  chartInstance->chartInfo.derivatives = NULL;
  chartInstance->chartInfo.mdlRTW = mdlRTW_c2_stm32_pid_v1_mod;
  chartInstance->chartInfo.mdlStart = mdlStart_c2_stm32_pid_v1_mod;
  chartInstance->chartInfo.mdlSetWorkWidths =
    mdlSetWorkWidths_c2_stm32_pid_v1_mod;
  chartInstance->chartInfo.extModeExec = NULL;
  chartInstance->chartInfo.restoreLastMajorStepConfiguration = NULL;
  chartInstance->chartInfo.restoreBeforeLastMajorStepConfiguration = NULL;
  chartInstance->chartInfo.storeCurrentConfiguration = NULL;
  chartInstance->S = S;
  ssSetUserData(S,(void *)(&(chartInstance->chartInfo)));/* register the chart instance with simstruct */
  init_dsm_address_info(chartInstance);
  if (!sim_mode_is_rtw_gen(S)) {
  }

  sf_opaque_init_subchart_simstructs(chartInstance->chartInfo.chartInstance);
  chart_debug_initialization(S,1);
}

void c2_stm32_pid_v1_mod_method_dispatcher(SimStruct *S, int_T method, void
  *data)
{
  switch (method) {
   case SS_CALL_MDL_START:
    mdlStart_c2_stm32_pid_v1_mod(S);
    break;

   case SS_CALL_MDL_SET_WORK_WIDTHS:
    mdlSetWorkWidths_c2_stm32_pid_v1_mod(S);
    break;

   case SS_CALL_MDL_PROCESS_PARAMETERS:
    mdlProcessParameters_c2_stm32_pid_v1_mod(S);
    break;

   default:
    /* Unhandled method */
    sf_mex_error_message("Stateflow Internal Error:\n"
                         "Error calling c2_stm32_pid_v1_mod_method_dispatcher.\n"
                         "Can't handle method %d.\n", method);
    break;
  }
}
